cf/Documents/КорректировкаВнутреннегоЗаказа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаВнутреннегоЗаказа</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВнутренниеЗаказы</xr:Item>
				<xr:Item>AccumulationRegister.ТоварыВРезерве</xr:Item>
				<xr:Item>AccumulationRegister.РазмещениеЗаказов</xr:Item>
				<xr:Item>AccumulationRegister.ОтгруженныеЗаказы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БезДвиженийПоРезерву</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Размещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/Documents/КорректировкаВнутреннегоЗаказа/Ext/ObjectModule.bsl
Функция ПолучитьТекстЗапросаПолученияСпискаТоваров() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ.КорректировкаВнутреннегоЗаказа.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка
	|";
	
КонецФункции
Функция ПолучитьТекстЗапросаПолученияСпискаРезервируемыхТоваров() Экспорт
	
	Возврат "
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура
	|ИЗ
	|	Документ.КорректировкаВнутреннегоЗаказа.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка И
	|	ЕСТЬNULL(Размещение, &ПустойСклад) <> &ПустойСклад
	|";
	
КонецФункции
Функция ПолучитьТекстЗапросаПолученияТаблицыРезервируемыхТоваров() Экспорт
	
	// Запрос для соединения должен содержать поля (Товар, Размещение, Количество)
	
	Возврат "
	|ВЫБРАТЬ
	|	Номенклатура, Размещение, СУММА(Количество) КАК Количество
	|ИЗ
	|	Документ.КорректировкаВнутреннегоЗаказа.Товары
	|ГДЕ
	|	Ссылка = &ДокументСсылка И
	|	ЕСТЬNULL(Размещение, &ПустойСклад) <> &ПустойСклад
	|";
	
КонецФункции
Функция ПолучитьСкладСписания() Экспорт
	
	Возврат Неопределено;
	
КонецФункции



Процедура ОбработкаПроведения(Отказ, Режим)
   
	// Подготовка
	
	Заголовок = КонтрольПроведения.ПолучитьСтандарнтыйЗаголовокПриПроведенииДокумента(Ссылка);
	
	Документы[Метаданные().Имя].ИницилизироватьДополнительныеДанныеДокумента(Ссылка, ДополнительныеСвойства);
	
	// Проведение
	                                     
	ПроведенияДокументов.ПровестиПоВсемРегистрам(
					Метаданные().Движения, 
					ДополнительныеСвойства, 
					Движения, 
					Отказ);
	
	// Запись
	
	Движения.Записать();
	
	// Контроль
	
	КонтрольПроведения.ПроверитьТоварыНаСкладах(ЭтотОбъект,, Отказ, Заголовок);
	КонтрольПроведения.ПроверитьПоВсемРегистрам(ЭтотОбъект, Отказ, Заголовок);

	
	// Установим статус оплаты
	
	Если 	Не Отказ И
			Не Заказы.ПроверитьИУстановитьСтатусОплатыЗаказа(Заказ) Тогда
			
		Отказ = Истина;
			
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	стрОшибки = "";
	Если ТипЗнч(Заказ.Заказчик) = Тип("СправочникСсылка.Склады") И Заказ.Заказчик.ПередачаТовараМВЗ Тогда
		
		Контрагент = Заказ.Заказчик.Контрагент;
		Если Контрагент = Неопределено Тогда 
			
			ОбщиеФункции.СообщитьТекст("Не заполнен Контрагент для склада.");
			Отказ = Истина;
			
		ИначеЕсли НЕ Заказы.ТоварыРазрешеныКПередаче(Ссылка, "КорректировкаВнутреннегоЗаказа", стрОшибки, , Контрагент) Тогда
			
			Отказ = Истина;
			ОбщиеФункции.СообщитьТекст(стрОшибки); 
		КонецЕсли; 
	КонецЕсли;

КонецПроцедуры
